# Используем официальный образ Node.js в качестве базового
FROM node:20.15.1-alpine

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем package.json и package-lock.json в рабочую директорию
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы приложения в рабочую директорию контейнера
COPY . .

# Собираем приложение
RUN npm run build

# Устанавливаем сервер для обслуживания статических файлов (например, serve)
RUN npm install -g serve

# Указываем команду по умолчанию для запуска приложения
CMD ["serve", "-s", "build"]

# Указываем, что контейнер прослушивает порт 3000
EXPOSE 3000
